[
  { "term": "Sumud", "arabic": "صمود", "definition": "Meaning 'steadfastness' or 'perseverance', it describes the Palestinian spirit of resilience and defiance against occupation." },
  { "term": "Nakba", "arabic": "النكبة", "definition": "Meaning 'The Catastrophe', it refers to the 1948 displacement and dispossession of hundreds of thousands of Palestinians." },
  { "term": "Intifada", "arabic": "انتفاضة", "definition": "Literally 'shaking off', it refers to popular uprisings by Palestinians against the Israeli occupation." },
    { "term": "Al-Quds", "arabic": "القدس", "definition": "The Arabic name for Jerusalem, a city of profound significance in Palestinian history and culture." },
    { "term": "BDS", "arabic": "مقاطعة وسحب استثمار وعقوبات", "definition": "An acronym for Boycott, Divestment, Sanctions, a global movement advocating for Palestinian rights." },
    { "term": "Jenin", "arabic": "جنين", "definition": "A city in the northern West Bank known for its refugee camp and historical significance in Palestinian resistance." },
    { "term": "Gaza", "arabic": "غزة", "definition": "A coastal city in the Gaza Strip, it has been a focal point of the Israeli-Palestinian conflict and is known for its dense population and humanitarian challenges." },
    { "term": "Al-Aqsa", "arabic": "الأقصى", "definition": "Refers to the Al-Aqsa Mosque in Jerusalem, a site of great religious significance for Muslims and a symbol of Palestinian identity." },
    { "term": "Hamas", "arabic": "حماس", "definition": "An acronym for 'Harakat al-Muqawama al-Islamiyya', it is a Palestinian Islamic political and militant organization." },
    { "term": "Fatah", "arabic": "فتح", "definition": "A major Palestinian political party and the leading faction within the Palestine Liberation Organization (PLO)." },
    { "term": "PLO", "arabic": "منظمة التحرير الفلسطينية", "definition": "The Palestine Liberation Organization, a political and paramilitary organization founded in 1964 to represent the Palestinian people." },
    { "term": "Al-Nakba", "arabic": "النكبة", "definition": "Refers to the mass displacement of Palestinians during the 1948 Arab-Israeli War, marking the beginning of the Palestinian refugee crisis." },
    { "term": "Al-Awda", "arabic": "العودة", "definition": "Meaning 'the return', it refers to the right of Palestinian refugees to return to their homes and lands." },
    { "term": "Al-Quds Day", "arabic": "يوم القدس", "definition": "An annual event held on the last Friday of Ramadan to express solidarity with Palestinians and opposition to Israeli occupation." },
    { "term": "Al-Khalil", "arabic": "الخليل", "definition": "The Arabic name for Hebron, a city in the West Bank known for its religious significance and historical sites." },
    { "term": "Al-Bireh", "arabic": "البيرة", "definition": "A city in the central West Bank, part of the Ramallah metropolitan area, known for its cultural and educational institutions." },
  { "term": "Al-Lydd", "arabic": "اللد", "definition": "The Arabic name for Lod, a city in Israel with a significant Palestinian population." },
  { "term": "Al-Tamimi", "arabic": "التميمي", "definition": "A prominent Palestinian family known for its activism, particularly in the village of Nabi Saleh." },
  { "term": "Al-Kurd", "arabic": "الكرد", "definition": "A Palestinian family known for their resistance against home demolitions and displacement in Sheikh Jarrah, East Jerusalem." },
  { "term": "Al-Masjid Al-Aqsa", "arabic": "المسجد الأقصى", "definition": "The third holiest site in Islam, located in Jerusalem, it is a focal point of Palestinian cultural and religious identity." },
  { "term": "Al-Qassam Brigades", "arabic": "كتائب القسام", "definition": "The military wing of Hamas, named after Izz ad-Din al-Qassam, a Syrian preacher who fought against British colonial rule." },
  { "term": "Al-Quds Intifada", "arabic": "انتفاضة القدس", "definition": "Refers to the wave of protests and violence that erupted in 2015, sparked by tensions over Al-Aqsa Mosque." },
  { "term": "Al-Masirah", "arabic": "المسيرة", "definition": "Meaning 'the march', it often refers to peaceful protests and demonstrations in support of Palestinian rights." },
  { "term": "Al-Muqaddas", "arabic": "المقدس", "definition": "An Arabic term meaning 'the holy', often used to refer to Jerusalem in a religious context." },
  { "term": "Al-Quds University", "arabic": "جامعة القدس", "definition": "A major Palestinian university located in East Jerusalem, known for its academic programs and research." },
  { "term": "Al-Aqsa Martyrs' Brigades", "arabic": "كتائب شهداء الأقصى", "definition": "A militant group associated with Fatah, named after the Al-Aqsa Mosque." },
  { "term": "Al-Nakba Day", "arabic": "يوم النكبة", "definition": "Commemorated on May 15th, it marks the anniversary of the Nakba and the ongoing plight of Palestinian refugees." },
  { "term": "Al-Quds Liberation", "arabic": "تحرير القدس", "definition": "Refers to the aspiration for the liberation of Jerusalem from occupation and its significance in Palestinian nationalism." },
  { "term": "Al-Awda Movement", "arabic": "حركة العودة", "definition": "A movement advocating for the right of return for Palestinian refugees to their ancestral homes." },
  { "term": "Al-Muqawama al-Islamiyya", "arabic": "المقاومة الإسلامية", "definition": "The Islamic Resistance Movement, commonly known as Hamas, which plays a significant role in Palestinian politics and resistance." },
  { "term": "Al-Quds Intifada", "arabic": "انتفاضة القدس", "definition": "Refers to the ongoing struggle for Palestinian rights and sovereignty, particularly in Jerusalem." },
  { "term": "Al-Quds Resistance", "arabic": "مقاومة القدس", "definition": "Refers to the collective efforts of Palestinians to resist occupation and assert their rights in Jerusalem." },
  { "term": "Al-Quds Solidarity", "arabic": "تضامن القدس", "definition": "Refers to the global solidarity movements supporting Palestinian rights, particularly in Jerusalem." },
  { "term": "Al-Quds Heritage", "arabic": "تراث القدس", "definition": "Refers to the rich cultural and historical heritage of Jerusalem, significant to Palestinians and Muslims worldwide." },
  { "term": "Al-Quds Freedom", "arabic": "حرية القدس", "definition": "Refers to the aspiration for freedom and justice for Palestinians in Jerusalem." },
  { "term": "Al-Quds Unity", "arabic": "وحدة القدس", "definition": "Refers to the unity among Palestinians in their struggle for rights and sovereignty in Jerusalem." },
  { "term": "Al-Quds Liberation Front", "arabic": "جبهة تحرير القدس", "definition": "A term used by various Palestinian factions advocating for the liberation of Jerusalem from occupation." },
  { "term": "Al-Quds Martyrs", "arabic": "شهداء القدس", "definition": "Refers to those who have sacrificed their lives in the struggle for Palestinian rights, particularly in Jerusalem." },
  { "term": "Al-Quds Intifada Movement", "arabic": "حركة انتفاضة القدس", "definition": "A movement focused on the ongoing resistance against occupation in Jerusalem." },
  { "term": "Al-Quds Cultural Heritage", "arabic": "التراث الثقافي للقدس", "definition": "Refers to the preservation and promotion of Jerusalem's diverse cultural heritage." },
  { "term": "Al-Quds Education", "arabic": "تعليم القدس", "definition": "Refers to the educational initiatives and institutions in Jerusalem, often facing challenges due to occupation." },
  { "term": "Al-Quds Youth", "arabic": "شباب القدس", "definition": "Refers to the younger generation of Palestinians in Jerusalem, who play a crucial role in the resistance and cultural preservation." },
  { "term": "Al-Nasr", "arabic": "النصر", "definition": "Meaning 'victory', it is often used in the context of Palestinian aspirations for freedom and self-determination." },
  { "term": "Al-Muqawama", "arabic": "المقاومة", "definition": "Meaning 'resistance', it refers to the various forms of Palestinian struggle against occupation and oppression." },
    { "term": "Al-Quds Resistance Front", "arabic": "جبهة مقاومة القدس", "definition": "A coalition of Palestinian factions united in their struggle for rights and sovereignty in Jerusalem." },
    { "term": "Al-Quds Liberation Movement", "arabic": "حركة تحرير القدس", "definition": "A movement focused on the liberation of Jerusalem from occupation and the assertion of Palestinian rights." },
    { "term": "Al-Quds Solidarity Movement", "arabic": "حركة تضامن القدس", "definition": "A global movement advocating for Palestinian rights, particularly in Jerusalem." },
    { "term": "Al-Quds Freedom Fighters", "arabic": "مقاتلو حرية القدس", "definition": "Refers to those who actively resist occupation and fight for Palestinian rights in Jerusalem." },
    { "term": "Al-Quds Martyrs' Brigade", "arabic": "كتائب شهداء القدس", "definition": "A militant group named after the Al-Aqsa Mosque, involved in the Palestinian resistance." },
    { "term": "Al-Quds Intifada Front", "arabic": "جبهة انتفاضة القدس", "definition": "A front formed by various Palestinian factions to coordinate efforts in the ongoing struggle for rights in Jerusalem." },
    { "term": "Al-Quds Cultural Resistance", "arabic": "المقاومة الثقافية للقدس", "definition": "Refers to the efforts to preserve and promote Palestinian culture and heritage in Jerusalem." },
    { "term": "Al-Quds Educational Resistance", "arabic": "المقاومة التعليمية للقدس", "definition": "Refers to the educational initiatives aimed at empowering Palestinians in Jerusalem through knowledge and awareness." },
    { "term": "Al-Quds Youth Movement", "arabic": "حركة شباب القدس", "definition": "A movement led by young Palestinians in Jerusalem, focusing on cultural preservation and resistance." },
    { "term": "Al-Quds Women's Movement", "arabic": "حركة نساء القدس", "definition": "A movement advocating for the rights and empowerment of women in Jerusalem." }
]